tap "austinjones/taps"
tap "candid82/brew"
tap "cormacrelf/tap"
tap "danielgtaylor/restish"
tap "felixkratz/formulae"
tap "ggp1/tap"
tap "goreleaser/tap"
tap "grdl/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hors-org/hors"
tap "jesseduffield/lazygit"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "louisbrunner/valgrind"
tap "mongodb/brew"
tap "mrkai77/cask"
tap "ms-jpq/sad"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pantsbuild/tap"
tap "spicetify/tap"
tap "tinygo-org/tools"
tap "universal-ctags/universal-ctags"
tap "xwmx/taps"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Automatically exclude development dependencies from Time Machine backups
brew "asimov"
# Spell checker with better logic than ispell
brew "aspell"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Emacs dependency management
brew "cask"
# Implementation of the Chez Scheme language
brew "chezscheme"
# Compiler for the Scheme programming language
brew "chicken"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Implementation of the Scheme Language
brew "gambit-scheme"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Nonsense activity generator
brew "genact"
# GitHub command-line tool
brew "gh"
# Installer for the general purpose language Haskell
brew "ghcup"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Git Submodule Alternative
brew "git-subrepo"
# Manage your git repositories in one place
brew "gitbatch"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Convert HCL2 to JSON
brew "hcl2json"
# Post-modern modal text editor
brew "helix"
# Command-line benchmarking tool
brew "hyperfine"
# International Ispell
brew "ispell"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Terminal file manager
brew "lf"
# Sophisticated file transfer program
brew "lftp"
# Implementation of the file(1) command
brew "libmagic"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Platform built on V8 to build network applications
brew "node"
# Text-based UI library
brew "ncurses"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# OCaml package manager
brew "opam"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Static type checker for Python
brew "pyright"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Rust toolchain installer
brew "rustup-init"
# Autoformat shell script source code
brew "shfmt"
# Simple keystroke visualizer
brew "showkey"
# SOcket CAT: netcat on steroids
brew "socat"
# State of the art linter for the Go programming language
brew "staticcheck"
# Opinionated Lua code formatter
brew "stylua"
# TOML toolkit written in Rust
brew "taplo"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# User interface to the TELNET protocol
brew "telnet"
# Terraform Language Server
brew "terraform-ls"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Digital clock in ncurses
brew "tty-clock"
# V programming language
brew "vlang"
# Internet file retriever
brew "wget"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Yet Another Dotfiles Manager
brew "yadm"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Small Clojure interpreter and linter
brew "candid82/brew/joker"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# Restish is a CLI for interacting with REST-ish HTTP APIs with some nice features built-in.
brew "danielgtaylor/restish/restish"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Better way to clone, organize and manage multiple git repositories
brew "grdl/tap/git-get"
# instant coding answers via the command line (howdoi in rust)
brew "hors-org/hors/hors"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
brew "keith/formulae/reminders-cli"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Search and replace | Space Age seD
brew "ms-jpq/sad/sad"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
cask "beardedspice"
# Web browser focusing on privacy
cask "brave-browser"
# Automation tool
cask "bunch"
# Managed desktop virtualization solution
cask "citrix-workspace"
# App for building websites
cask "codekit"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Web browser
cask "firefox"
# Icon set and toolkit
cask "font-fontawesome"
# Typeface made for developers
cask "font-jetbrains-mono"
# Icons based on core Material Design principles
cask "font-material-icons"
# Monospaced variable font
cask "font-noto-sans-mono"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-roboto-mono"
# Just as comfortable to read and work in print media
cask "font-roboto-serif"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# End-to-end encryption software
cask "keybase"
# GPU-based terminal emulator
cask "kitty"
# Productivity tool
cask "launchbar"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Web browser
cask "microsoft-edge"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Visual communication software
cask "omnigraffle"
# Fast, scalable, user-friendly build system for codebases of all sizes
cask "pants"
# Collaboration platform for API development
cask "postman"
# VPN client
cask "private-internet-access"
# Peer to peer Bitorrent client
cask "qbittorrent"
# All-in-one bookmark manager
cask "raindropio"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# To-do list
cask "todoist"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Torrent streaming application
cask "webtorrent"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "Evernote", id: 406056744
mas "GoodTask", id: 1143437985
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "MindNode", id: 992076693
mas "Silicio", id: 933627574
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Transmit", id: 403388562
mas "Trello", id: 1278508951
mas "UpNote", id: 1398373917
vscode "4ops.terraform"
vscode "a-h.templ"
vscode "alfredbirk.tailwind-documentation"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "braver.vscode-solarized"
vscode "charliermarsh.ruff"
vscode "dotjoshjohnson.xml"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "huytd.nord-light"
vscode "jinliming2.vscode-go-template"
vscode "keifererikson.nightfox"
vscode "laike9m.cyberbrain"
vscode "magicstack.magicpython"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "redhat.vscode-yaml"
vscode "rpbritton.zenbones"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "samuelcolvin.jinjahtml"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "supperchong.pretty-json"
vscode "tamasfe.even-better-toml"
vscode "vincaslt.highlight-matching-tag"
vscode "webfreak.debug"
vscode "zaaack.markdown-editor"
