tap "austinjones/taps"
tap "borkdude/brew"
tap "browsh-org/browsh"
tap "bufbuild/buf"
tap "caarlos0/tap"
tap "candid82/brew"
tap "cmacrae/formulae"
tap "cormacrelf/tap"
tap "crisidev/chunkwm"
tap "danielgtaylor/restish"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "ggp1/tap"
tap "goreleaser/tap"
tap "grdl/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hors-org/hors"
tap "jesseduffield/lazygit"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "leg100/tap"
tap "louisbrunner/valgrind"
tap "mongodb/brew"
tap "mrkai77/cask"
tap "ms-jpq/sad"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pantsbuild/tap"
tap "redis-stack/redis-stack"
tap "spicetify/tap"
tap "tidwall/jj"
tap "tinygo-org/tools"
tap "universal-ctags/universal-ctags"
tap "xwmx/taps"
brew "libpng"
brew "xz"
brew "asimov"
brew "aspell"
brew "azure-cli"
brew "icu4c@76"
brew "node"
brew "basedpyright"
brew "bat"
brew "btop"
brew "glib"
brew "cargo-instruments"
brew "catimg"
brew "certbot"
brew "chezscheme"
brew "clisp"
brew "cmake"
brew "cocoapods"
brew "curl"
brew "ddate"
brew "docker-compose"
brew "docker-credential-helper"
brew "duti"
brew "elixir"
brew "elixir-ls"
brew "entr"
brew "eza"
brew "fd"
brew "fennel"
brew "gmp"
brew "harfbuzz"
brew "libarchive"
brew "ffmpeg"
brew "fftw"
brew "fluid-synth"
brew "fzf"
brew "gawk"
brew "genact"
brew "gh"
brew "ghc"
brew "ghcup"
brew "git-crypt"
brew "git-filter-repo"
brew "git-flow"
brew "git-lfs"
brew "git-subrepo"
brew "gitup"
brew "glances"
brew "glow"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gpgme"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "hcl2json"
brew "helix"
brew "ncurses"
brew "htop"
brew "hyperfine"
brew "ical-buddy"
brew "ispell"
brew "jd"
brew "jid"
brew "jq"
brew "jql"
brew "jrnl"
brew "julia"
brew "keydb"
brew "kind"
brew "openjdk"
brew "kotlin"
brew "kubernetes-cli"
brew "lf"
brew "lftp"
brew "libheif"
brew "libmagic"
brew "libpq"
brew "links"
brew "lua-language-server"
brew "luarocks"
brew "lunchy"
brew "lynx"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "mas"
brew "meson"
brew "mingw-w64"
brew "mkcert"
brew "mongosh"
brew "mplayer"
brew "yt-dlp"
brew "mpv"
brew "nanomsg"
brew "tree-sitter"
brew "neovim"
brew "nim"
brew "nmap"
brew "ollama"
brew "opam"
brew "openslide"
brew "ormolu"
brew "pandoc"
brew "perltidy"
brew "pipx"
brew "pnpm", link: false
brew "pyenv"
brew "pyright"
brew "qcachegrind"
brew "ragel"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "remind"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "rustup"
brew "screenfetch"
brew "shfmt"
brew "showkey"
brew "socat"
brew "sonarqube"
brew "staticcheck"
brew "stylua"
brew "swiftformat"
brew "swiftlint"
brew "syncthing"
brew "tailwindcss"
brew "taplo"
brew "tasksh"
brew "taskwarrior-tui"
brew "tcl-tk"
brew "telnet"
brew "terraform-ls"
brew "tfenv"
brew "tig"
brew "timewarrior"
brew "tldr"
brew "tree"
brew "tty-clock"
brew "typescript"
brew "universal-ctags", args: ["HEAD"]
brew "vlang"
brew "w3m"
brew "wget"
brew "xq"
brew "yadm"
brew "yamlfmt"
brew "yarn"
brew "yazi"
brew "yewtube"
brew "yq"
brew "zig"
brew "zinit"
brew "zlib"
brew "zls"
brew "zoxide"
brew "borkdude/brew/babashka"
brew "bufbuild/buf/buf"
brew "caarlos0/tap/timer"
brew "candid82/brew/joker"
brew "cormacrelf/tap/dark-notify"
brew "danielgtaylor/restish/restish"
brew "ggp1/tap/kure"
brew "goreleaser/tap/goreleaser"
brew "grdl/tap/git-get"
brew "hashicorp/tap/nomad"
brew "hors-org/hors/hors"
brew "jesseduffield/lazygit/lazygit"
brew "keith/formulae/reminders-cli"
brew "leg100/tap/pug"
brew "mongodb/brew/mongodb-community"
brew "ms-jpq/sad/sad"
brew "nats-io/nats-tools/nats"
brew "xwmx/taps/nb"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "bartender"
cask "citrix-workspace"
cask "db-browser-for-sqlite"
cask "discord"
cask "downie"
cask "dropbox"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-material-icons"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-roboto-serif"
cask "font-sf-mono"
cask "font-ubuntu"
cask "garmin-express"
cask "google-chrome"
cask "google-drive"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "launchbar"
cask "launchcontrol"
cask "lm-studio"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mongodb-compass"
cask "obsidian"
cask "omnigraffle"
cask "podman-desktop"
cask "postman"
cask "powerphotos"
cask "qbittorrent"
cask "rar"
cask "rectangle"
cask "redis-stack"
cask "redis-stack-redisinsight"
cask "redis-stack-server"
cask "scrivener"
cask "sf-symbols"
cask "spotify"
cask "tiddly"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "wezterm@nightly"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "DotChart", id: 6737857267
mas "Enchanted", id: 6474268307
mas "Free Ruler", id: 1483172210
mas "Ghostery Privacy Ad Blocker", id: 6504861501
mas "GoodTask", id: 1143437985
mas "MarkChart", id: 6475648822
mas "MindNode", id: 992076693
mas "Structured", id: 1499198946
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Transmit", id: 403388562
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "4ops.terraform"
vscode "a-h.templ"
vscode "alfredbirk.tailwind-documentation"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dotjoshjohnson.xml"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jinliming2.vscode-go-template"
vscode "laike9m.cyberbrain"
vscode "magicstack.magicpython"
vscode "mattn.lisp"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "sswg.swift-lang"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "supperchong.pretty-json"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.graphviz-interactive-preview"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vosca.vscode-v-analyzer"
vscode "vstirbu.vscode-mermaid-preview"
vscode "webfreak.debug"
vscode "zaaack.markdown-editor"
