tap "austinjones/taps"
tap "browsh-org/browsh"
tap "bufbuild/buf"
tap "candid82/brew"
tap "cmacrae/formulae"
tap "cormacrelf/tap"
tap "crisidev/chunkwm"
tap "danielgtaylor/restish"
tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "gcenx/wine"
tap "ggp1/tap"
tap "goreleaser/tap"
tap "grdl/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hors-org/hors"
tap "jesseduffield/lazygit"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "louisbrunner/valgrind"
tap "mongodb/brew"
tap "mrkai77/cask"
tap "ms-jpq/sad"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "pantsbuild/tap"
tap "spicetify/tap"
tap "tidwall/jj"
tap "tinygo-org/tools"
tap "universal-ctags/universal-ctags"
tap "xwmx/taps"
brew "abduco"
brew "libpng"
brew "xz"
brew "asimov"
brew "aspell"
brew "azure-cli"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "gmp"
brew "btop"
brew "glib"
brew "cargo-instruments"
brew "catimg"
brew "certbot"
brew "chezscheme"
brew "chicken"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "cowsay"
brew "crystal"
brew "curl"
brew "ddate"
brew "deno"
brew "dotnet"
brew "dub"
brew "duti"
brew "efm-langserver"
brew "erlang"
brew "elixir"
brew "entr"
brew "exa"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fftw"
brew "figlet"
brew "fluid-synth"
brew "fzf"
brew "gambit-scheme"
brew "gawk"
brew "genact"
brew "gh"
brew "ghc"
brew "ghcup"
brew "git-crypt"
brew "git-filter-repo"
brew "git-flow"
brew "git-lfs"
brew "git-subrepo"
brew "gitbatch"
brew "gitup"
brew "glances"
brew "glow"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gpgme"
brew "grafana"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "hadolint"
brew "hcl2json"
brew "helix"
brew "hping"
brew "ncurses"
brew "htop"
brew "hyperfine"
brew "ical-buddy"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "ispell"
brew "jd"
brew "jid"
brew "openslide"
brew "vips"
brew "joplin-cli"
brew "jq"
brew "jql"
brew "jrnl"
brew "keydb"
brew "openjdk"
brew "kotlin"
brew "lf"
brew "lftp"
brew "libcouchbase"
brew "libmagic"
brew "libpq"
brew "links"
brew "lolcat"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "meson"
brew "mingw-w64"
brew "mkcert"
brew "mongosh"
brew "mplayer"
brew "yt-dlp"
brew "mpv"
brew "nanomsg"
brew "neofetch"
brew "neovim"
brew "nim"
brew "nmap"
brew "nng"
brew "nnn"
brew "nushell"
brew "odin"
brew "opam"
brew "ormolu"
brew "pandoc"
brew "perltidy"
brew "pgcli"
brew "pipx"
brew "pnpm"
brew "ponyc"
brew "postgresql@14"
brew "prometheus"
brew "pyenv"
brew "pyright"
brew "tcl-tk", link: false
brew "python-tk@3.11"
brew "python-tk@3.9"
brew "qcachegrind"
brew "ragel"
brew "ranger"
brew "reattach-to-user-namespace"
brew "redis"
brew "remind"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "rustup-init"
brew "screenfetch"
brew "shfmt"
brew "showkey"
brew "sift"
brew "socat"
brew "spotify-tui"
brew "staticcheck"
brew "stylua"
brew "subversion"
brew "swiftformat"
brew "taplo"
brew "taskd"
brew "tasksh"
brew "taskwarrior-tui"
brew "telnet"
brew "terraform", link: false
brew "terraform-ls"
brew "terragrunt"
brew "tfenv"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tig"
brew "timewarrior"
brew "tmux"
brew "tree"
brew "tty-clock"
brew "universal-ctags", args: ["HEAD"]
brew "vifm"
brew "vlang"
brew "w3m"
brew "webtorrent-cli"
brew "wget"
brew "xq"
brew "yadm"
brew "yamlfmt"
brew "yarn"
brew "yewtube"
brew "yq"
brew "zellij"
brew "zig"
brew "zlib"
brew "zls"
brew "zoxide"
brew "bufbuild/buf/buf"
brew "candid82/brew/joker"
brew "cmacrae/formulae/spacebar"
brew "cormacrelf/tap/dark-notify"
brew "danielgtaylor/restish/restish"
brew "ggp1/tap/kure"
brew "goreleaser/tap/goreleaser"
brew "grdl/tap/git-get"
brew "hors-org/hors/hors"
brew "jesseduffield/lazygit/lazygit"
brew "keith/formulae/reminders-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mongodb/brew/mongodb-community"
brew "ms-jpq/sad/sad"
brew "oven-sh/bun/bun"
brew "spicetify/tap/spicetify-cli"
brew "xwmx/taps/nb"
cask "1password"
cask "1password-cli"
cask "adoptopenjdk8"
cask "alacritty"
cask "android-platform-tools"
cask "arc"
cask "balenaetcher"
cask "bartender"
cask "beardedspice"
cask "brave-browser"
cask "bunch"
cask "citrix-workspace"
cask "codekit"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "etrecheckpro"
cask "firefox"
cask "flutter"
cask "font-fontawesome"
cask "font-material-icons"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-serif"
cask "font-sf-mono"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "kitty-nightly"
cask "lapce"
cask "launchbar"
cask "launchcontrol"
cask "messenger"
cask "microsoft-edge"
cask "mono-mdk-for-visual-studio"
cask "obsidian"
cask "omnigraffle"
cask "onyx"
cask "pants"
cask "plex"
cask "plex-media-server"
cask "postman"
cask "private-internet-access"
cask "qbittorrent"
cask "rar"
cask "raycast"
cask "rectangle"
cask "sf-symbols"
cask "spaceman"
cask "spotify"
cask "steam"
cask "swiftdefaultappsprefpane"
cask "todoist"
cask "typora"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "wezterm-nightly"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Balance", id: 1637311725
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Developer", id: 640199958
mas "Evernote", id: 406056744
mas "GoodTask", id: 1143437985
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "MindNode", id: 992076693
mas "Silicio", id: 933627574
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Transmit", id: 403388562
mas "Trello", id: 1278508951
mas "Wipr", id: 1320666476
vscode "4ops.terraform"
vscode "alfredbirk.tailwind-documentation"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "dotjoshjohnson.xml"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "golang.go"
vscode "jinliming2.vscode-go-template"
vscode "laike9m.cyberbrain"
vscode "magicstack.magicpython"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "nickdemayo.vscode-json-editor"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "supperchong.pretty-json"
vscode "tamasfe.even-better-toml"
vscode "vincaslt.highlight-matching-tag"
vscode "webfreak.debug"
vscode "zaaack.markdown-editor"
