tap "browsh-org/browsh"
tap "bufbuild/buf"
tap "cmacrae/formulae"
tap "crisidev/chunkwm"
tap "dart-lang/dart"
tap "gcenx/wine"
tap "ggp1/tap"
tap "goreleaser/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "louisbrunner/valgrind"
tap "mongodb/brew"
tap "tidwall/jj"
tap "tinygo-org/tools"
tap "universal-ctags/universal-ctags"
tap "xwmx/taps"
brew "abduco"
brew "libpng"
brew "aspell"
brew "readline"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "xz"
brew "python@3.9"
brew "glib"
brew "tcl-tk"
brew "cargo-instruments"
brew "catimg"
brew "certbot"
brew "chezscheme"
brew "chicken"
brew "cmake"
brew "cmatrix"
brew "cocoapods"
brew "gmp"
brew "crystal"
brew "ddate"
brew "dmd"
brew "dub"
brew "duti"
brew "efm-langserver"
brew "erlang"
brew "elixir"
brew "entr"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fftw"
brew "figlet"
brew "flamegraph"
brew "fluid-synth"
brew "fortune"
brew "fzf"
brew "genact"
brew "ghc"
brew "git-flow"
brew "git-lfs"
brew "git-subrepo"
brew "go"
brew "grafana"
brew "graphviz"
brew "haskell-stack"
brew "hping"
brew "ncurses"
brew "htop"
brew "hyperfine"
brew "ical-buddy"
brew "idris"
brew "libheif"
brew "imagemagick"
brew "ispell"
brew "jd"
brew "jid"
brew "vips"
brew "joplin-cli"
brew "jq"
brew "jql"
brew "julia"
brew "keydb"
brew "lf"
brew "lftp"
brew "libcouchbase"
brew "libpq"
brew "links"
brew "lolcat"
brew "lua-language-server"
brew "luarocks"
brew "meson"
brew "midnight-commander"
brew "mingw-w64"
brew "mplayer"
brew "mps-youtube"
brew "mpv"
brew "nanomsg"
brew "neofetch"
brew "neovim"
brew "nim"
brew "nmap"
brew "nng"
brew "nnn"
brew "opam"
brew "openjdk"
brew "ormolu"
brew "pandoc"
brew "perltidy"
brew "pgcli"
brew "ponyc"
brew "postgresql"
brew "prometheus"
brew "pyenv"
brew "pyright"
brew "python-tk@3.9"
brew "qcachegrind"
brew "ragel"
brew "ranger"
brew "redis"
brew "remind"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "rust-analyzer"
brew "screenfetch"
brew "showkey"
brew "sift"
brew "stylua"
brew "subversion"
brew "swiftformat"
brew "swiftlint"
brew "tasksh"
brew "taskwarrior-tui"
brew "telnet"
brew "terraform"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "timewarrior"
brew "tmux"
brew "tree"
brew "tty-clock"
brew "ucg"
brew "ultralist"
brew "vifm"
brew "vlang"
brew "w3m"
brew "wget"
brew "wtfutil"
brew "yarn"
brew "youtube-dl"
brew "zig"
brew "zlib"
brew "bufbuild/buf/buf"
brew "cmacrae/formulae/spacebar"
brew "dart-lang/dart/dart"
brew "ggp1/tap/kure"
brew "goreleaser/tap/goreleaser"
brew "helix-editor/helix/helix"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "louisbrunner/valgrind/valgrind", args: ["HEAD"]
brew "mongodb/brew/mongodb-community"
brew "tidwall/jj/jj"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "xwmx/taps/nb"
cask "alacritty"
cask "android-studio"
cask "db-browser-for-sqlite"
cask "dotnet-sdk"
cask "dozer"
cask "firefox"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fontawesome"
cask "font-jetbrains-mono-nerd-font"
cask "font-material-icons"
cask "font-materialdesignicons-webfont"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-ubuntu"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "java"
cask "joplin"
cask "kitty-nightly"
cask "launchbar"
cask "mactex"
cask "qbittorrent"
cask "swiftdefaultappsprefpane"
cask "todotxt"
cask "wezterm"
